In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
data = {
    'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year':[2000, 2001, 2002, 2001, 2002, 2003],
    'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2],
}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [4]:
frame.head()
pd.DataFrame(data, columns=['year', 'state', 'pop'])
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt', '测试'],
                     index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

       year   state  pop debt   测试
one    2000    Ohio  1.5  NaN  NaN
two    2001    Ohio  1.7  NaN  NaN
three  2002    Ohio  3.6  NaN  NaN
four   2001  Nevada  2.4  NaN  NaN
five   2002  Nevada  2.9  NaN  NaN
six    2003  Nevada  3.2  NaN  NaN

In [5]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', '测试'], dtype='object')

In [6]:
frame2['测试']
frame2.测试
frame2[['测试', 'pop']]

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: 测试, dtype: object

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: 测试, dtype: object

        测试  pop
one    NaN  1.5
two    NaN  1.7
three  NaN  3.6
four   NaN  2.4
five   NaN  2.9
six    NaN  3.2

In [7]:
frame2.loc['three']
frame2[0:2]
frame2['debt'] = 16.5
frame2
frame2['debt'] = np.arange(6.)
frame2

year     2002
state    Ohio
pop       3.6
debt      NaN
测试        NaN
Name: three, dtype: object

     year state  pop debt   测试
one  2000  Ohio  1.5  NaN  NaN
two  2001  Ohio  1.7  NaN  NaN

       year   state  pop  debt   测试
one    2000    Ohio  1.5  16.5  NaN
two    2001    Ohio  1.7  16.5  NaN
three  2002    Ohio  3.6  16.5  NaN
four   2001  Nevada  2.4  16.5  NaN
five   2002  Nevada  2.9  16.5  NaN
six    2003  Nevada  3.2  16.5  NaN

       year   state  pop  debt   测试
one    2000    Ohio  1.5   0.0  NaN
two    2001    Ohio  1.7   1.0  NaN
three  2002    Ohio  3.6   2.0  NaN
four   2001  Nevada  2.4   3.0  NaN
five   2002  Nevada  2.9   4.0  NaN
six    2003  Nevada  3.2   5.0  NaN

In [8]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt   测试
one    2000    Ohio  1.5   NaN  NaN
two    2001    Ohio  1.7  -1.2  NaN
three  2002    Ohio  3.6   NaN  NaN
four   2001  Nevada  2.4  -1.5  NaN
five   2002  Nevada  2.9  -1.7  NaN
six    2003  Nevada  3.2   NaN  NaN

In [9]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2
del frame2['pop']
frame2.columns

       year   state  pop  debt   测试  eastern
one    2000    Ohio  1.5   NaN  NaN     True
two    2001    Ohio  1.7  -1.2  NaN     True
three  2002    Ohio  3.6   NaN  NaN     True
four   2001  Nevada  2.4  -1.5  NaN    False
five   2002  Nevada  2.9  -1.7  NaN    False
six    2003  Nevada  3.2   NaN  NaN    False

Index(['year', 'state', 'debt', '测试', 'eastern'], dtype='object')

In [22]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3
frame3.T
frame3 = pd.DataFrame(pop, index=[2001, 2002, 2003])
frame3.loc[2003] = np.array([2.,3.],dtype="f8")
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     2.0   3.0

In [25]:
pdata = {'ohio': frame3['Ohio'][:-1],
        'nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

      ohio  nevada
2001   1.7     2.4
2002   3.6     2.9

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2003      2.0   3.0

In [26]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [2. , 3. ]])

In [29]:
frame2.values
frame3.index
frame3.columns

array([[2000, 'Ohio', nan, nan, True],
       [2001, 'Ohio', -1.2, nan, True],
       [2002, 'Ohio', nan, nan, True],
       [2001, 'Nevada', -1.5, nan, False],
       [2002, 'Nevada', -1.7, nan, False],
       [2003, 'Nevada', nan, nan, False]], dtype=object)

Int64Index([2001, 2002, 2003], dtype='int64', name='year')

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [30]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [31]:
index[1:]

Index(['b', 'c'], dtype='object')

In [32]:
labels = pd.Index(np.arange(3))
labels
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2
obj2.index is labels

Int64Index([0, 1, 2], dtype='int64')

0    1.5
1   -2.5
2    0.0
dtype: float64

True